aspdigital/EFM8-USB-MIDI/src/InitDevice.c
}

extern void CIP51_0_enter_DefaultMode_from_RESET(void) {
	// $[PFE0CN - Prefetch Engine Control]
	/***********************************************************************
	 - Each byte of a firmware flash write is written individually
	 - Disable the prefetch engine 
	 ***********************************************************************/
	PFE0CN = PFE0CN_FLBWE__BLOCK_WRITE_DISABLED | PFE0CN_PFEN__DISABLED;
	// [PFE0CN - Prefetch Engine Control]$

}

#if 0
extern void TIMER16_3_enter_DefaultMode_from_RESET(void) {
	// $[Timer Initialization]
	// Save Timer Configuration
	uint8_t TMR3CN0_TR3_save;
	TMR3CN0_TR3_save = TMR3CN0 & TMR3CN0_TR3__BMASK;
	// Stop Timer
	TMR3CN0 &= ~(TMR3CN0_TR3__BMASK);
	// [Timer Initialization]$

	// $[TMR3CN0 - Timer 3 Control]
	// [TMR3CN0 - Timer 3 Control]$

	// $[TMR3H - Timer 3 High Byte]
	/***********************************************************************
	 - Timer 3 High Byte = 0xF8
	 ***********************************************************************/
	TMR3H = (0xF8 << TMR3H_TMR3H__SHIFT);
	// [TMR3H - Timer 3 High Byte]$

	// $[TMR3L - Timer 3 Low Byte]
	/***********************************************************************
	 - Timer 3 Low Byte = 0x30
	 ***********************************************************************/
	TMR3L = (0x30 << TMR3L_TMR3L__SHIFT);
	// [TMR3L - Timer 3 Low Byte]$

	// $[TMR3RLH - Timer 3 Reload High Byte]
	/***********************************************************************
	 - Timer 3 Reload High Byte = 0xF0
	 ***********************************************************************/
	TMR3RLH = (0xF0 << TMR3RLH_TMR3RLH__SHIFT);
	// [TMR3RLH - Timer 3 Reload High Byte]$

	// $[TMR3RLL - Timer 3 Reload Low Byte]
	/***********************************************************************
	 - Timer 3 Reload Low Byte = 0x60
	 ***********************************************************************/
	TMR3RLL = (0x60 << TMR3RLL_TMR3RLL__SHIFT);
	// [TMR3RLL - Timer 3 Reload Low Byte]$

	// $[TMR3CN0]
	/***********************************************************************
	 - Start Timer 3 running
	 ***********************************************************************/
	TMR3CN0 |= TMR3CN0_TR3__RUN;
	// [TMR3CN0]$

	// $[Timer Restoration]
	// Restore Timer Configuration
	TMR3CN0 |= TMR3CN0_TR3_save;
	// [Timer Restoration]$

}
#endif

extern void PORTS_4_enter_DefaultMode_from_RESET(void) {
	// $[P4 - Port 4 Pin Latch]
	// [P4 - Port 4 Pin Latch]$

	// $[P4MDOUT - Port 4 Output Mode]
	/***********************************************************************
	 - P4.0 output is push-pull
	 - P4.1 output is push-pull
	 - P4.2 output is push-pull
	 - P4.3 output is open-drain
	 - P4.4 output is open-drain
	 - P4.5 output is open-drain
	 - P4.6 output is open-drain
	 - P4.7 output is open-drain
	 ***********************************************************************/
	P4MDOUT = P4MDOUT_B0__PUSH_PULL | P4MDOUT_B1__PUSH_PULL
			| P4MDOUT_B2__PUSH_PULL | P4MDOUT_B3__OPEN_DRAIN
			| P4MDOUT_B4__OPEN_DRAIN | P4MDOUT_B5__OPEN_DRAIN
			| P4MDOUT_B6__OPEN_DRAIN | P4MDOUT_B7__OPEN_DRAIN;
	// [P4MDOUT - Port 4 Output Mode]$

	// $[P4MDIN - Port 4 Input Mode]
	// [P4MDIN - Port 4 Input Mode]$

}

extern void PORTS_3_enter_DefaultMode_from_RESET(void) {
	// $[P3 - Port 3 Pin Latch]
	// [P3 - Port 3 Pin Latch]$

	// $[P3MDOUT - Port 3 Output Mode]
	/***********************************************************************
	 - P3.0 output is push-pull, all are.
	 - P3.1 output is push-pull
	 - P3.2 output is push-pull
	 - P3.3 output is push-pull
	 - P3.4 output is push-pull
	 - P3.5 output is push-pull
	 - P3.6 output is push-pull
	 - P3.7 output is push-pull
	 ***********************************************************************/
	P3MDOUT = P3MDOUT_B0__PUSH_PULL | P3MDOUT_B1__PUSH_PULL
			| P3MDOUT_B2__PUSH_PULL | P3MDOUT_B3__PUSH_PULL
			| P3MDOUT_B4__PUSH_PULL | P3MDOUT_B5__PUSH_PULL
			| P3MDOUT_B6__PUSH_PULL | P3MDOUT_B7__PUSH_PULL;
	// [P3MDOUT - Port 3 Output Mode]$

	// $[P3MDIN - Port 3 Input Mode]
	// [P3MDIN - Port 3 Input Mode]$

	// $[P3SKIP - Port 3 Skip]
	// [P3SKIP - Port 3 Skip]$
	P3 = 0x00;
}

/**
 * Timer 5 is used for ADC convert-start.
 */
extern void TIMER16_5_enter_DefaultMode_from_RESET(void) {
	// $[Timer Initialization]
	// Save Timer Configuration
	uint8_t TMR5CN0_TR5_save;
	SFRPAGE = 0x0F;
	TMR5CN0_TR5_save = TMR5CN0 & TMR5CN0_TR5__BMASK;
	// Stop Timer
	TMR5CN0 &= ~(TMR5CN0_TR5__BMASK);
	// [Timer Initialization]$

	// $[TMR5CN0 - Timer 5 Control]
	// [TMR5CN0 - Timer 5 Control]$

	// $[TMR5H - Timer 5 High Byte]
	// [TMR5H - Timer 5 High Byte]$

	// $[TMR5L - Timer 5 Low Byte]
	// [TMR5L - Timer 5 Low Byte]$

	// $[TMR5RLH - Timer 5 Reload High Byte]
	/***********************************************************************
	 - Timer 5 Reload High Byte = 0xF0
	 ***********************************************************************/
	TMR5RLH = (0xF0 << TMR5RLH_TMR5RLH__SHIFT);
	// [TMR5RLH - Timer 5 Reload High Byte]$

	// $[TMR5RLL - Timer 5 Reload Low Byte]
	/***********************************************************************
	 - Timer 5 Reload Low Byte = 0x60
	 ***********************************************************************/
	TMR5RLL = (0x60 << TMR5RLL_TMR5RLL__SHIFT);
	// [TMR5RLL - Timer 5 Reload Low Byte]$

	// $[TMR5CN0]
	// [TMR5CN0]$

	// $[Timer Restoration]
	// Restore Timer Configuration
	TMR5CN0 |= TMR5CN0_TR5_save;
	// [Timer Restoration]$

}

